{
  "id": "122622",
  "question": "question-200",
  "body": "A company has a serverless application on AWS that uses a fleet of AWS Lambda functions that have aliases. The company regularly publishes new Lambda function by using an in-house deployment solution. The company wants to improve the release process and to use traffic shifting. A newly published function version should initially make available only to a fixed percentage of production users.\n\nWhich solution will meet these requirements?\nA. Configure routing on the alias of the new function by using a weighted alias.\nB. Configure a canary deployment type for Lambda.\nC. Configure routing on the new versions by using environment variables.\nD. Configure a linear deployment type for Lambda.\nShow Suggested Answer",
  "comments": [
    {
      "user": "Digo30sp",
      "selectedAnswer": "A",
      "body": "The correct answer is (A).\n\nWeighted aliases allow you to route traffic to different versions of a function based on weights that you assign. This allows you to implement a canary deployment, where you initially route a small percentage of your traffic to the new version of the function, and then gradually increase the percentage as you gain confidence in the new version.",
      "reply": [
        {
          "user": "rimaSamir",
          "body": "If we need Canary deployment, then why not B ?\nHow you will use A in automated deployment?"
        },
        {
          "user": "albert_kuo",
          "body": "While canary deployments are a valid strategy for gradual rollouts, Lambda doesn't have a built-in \"canary deployment type.\" This option is misleading and not applicable in the context of Lambda functions."
        },
        {
          "user": "albert_kuo",
          "body": "the key word is \"fixed percentage\""
        }
      ]
    },
    {
      "user": "65703c1",
      "selectedAnswer": "A",
      "body": "A is the correct answer.",
      "reply": []
    },
    {
      "user": "DeaconStJohn",
      "selectedAnswer": "B",
      "body": "I am struggling to see how the correct answer isn't canary. please feel free to enlighten me as I am at a loss how this question description is anything but canary",
      "reply": [
        {
          "user": "DeaconStJohn",
          "body": "is this question a case of what naming convention is used within Lambda service. i.e. Canary deployments via Weighted Aliases."
        },
        {
          "user": "DeaconStJohn",
          "body": "Still very on the fence with this one. \nMy key take aways are that the question says an in house deployment solution and not \"codedeploy.\"\nBy using weighted aliases we are in fact performing a canary deployments.\n\nBitch of a question."
        },
        {
          "user": "ahadh7621",
          "body": "My thought process is this. They can't use Canary Deployment because that is specifically for AWS CodeDeploy: https://docs.aws.amazon.com/codedeploy/latest/userguide/deployment-configurations.html\n\nThey are using an in-house deployment method, so AWS canary deployments aren't applicable. They can, however, use routing configuration on an alias to send a portion of traffic to a second function version. For example, you can reduce the risk of deploying a new version by configuring the alias to send most of the traffic to the existing version, and only a small percentage of traffic to the new version.\n\nhttps://docs.aws.amazon.com/lambda/latest/dg/configuration-aliases.html#configuring-alias-routing"
        }
      ]
    },
    {
      "user": "KarBiswa",
      "selectedAnswer": "A",
      "body": "https://docs.aws.amazon.com/lambda/latest/dg/configuration-aliases.html#configuring-alias-routing:~:text=function%20version.%20For%20example%2C%20you%20can%20reduce%20the%20risk%20of%20deploying%20a%20new%20version%20by%20configuring%20the%20alias%20to%20send%20most%20of%20the%20traffic%20to%20the%20existing%20version%2C%20and%20only%20a%20small%20percentage%20of%20traffic%20to%20the%20new%20version.",
      "reply": []
    },
    {
      "user": "NijeshT",
      "selectedAnswer": "",
      "body": "Answer is A.\nweighted aliases offer fixed, predefined percentages",
      "reply": []
    },
    {
      "user": "fordiscussionstwo",
      "selectedAnswer": "",
      "body": "AAAAAAAAAAA",
      "reply": []
    }
  ]
}